import re
def transliterate(text):    #функция по замене букв
    ru_eng_alphabet = {'а':'a','б':'b','в':'v','г':'g','д':'d','е':'e','ё':'yo',
      'ж':'zh','з':'z','и':'i','й':'y','к':'k','л':'l','м':'m','н':'n',
      'о':'o','п':'p','р':'r','с':'s','т':'t','у':'u','ф':'f','х':'kh',
      'ц':'ts','ч':'ch','ш':'sh','щ':'shch','ъ':'','ы':'y','ь':"'",'э':'e',
      'ю':'yu','я':'ya', 'А':'A','Б':'B','В':'V','Г':'G','Д':'D','Е':'E','Ё':'E',
      'Ж':'ZH','З':'Z','И':'I','Й':'Y','К':'K','Л':'L','М':'M','Н':'N',
      'О':'O','П':'P','Р':'R','С':'S','Т':'T','У':'U','Ф':'F','Х':'KH',
      'Ц':'TS','Ч':'CH','Ш':'SH','Щ':'SHCH','Ъ':'','Ы':'Y','Ь':"'",'Э':'E',
      'Ю':'YU','Я':'YA'}

    eng_ru_alphabet = {'Ya':'Я','Yu':'Ю','Ts':'Ц','Kh':'Х','Shch':'Щ','Sh':'Ш','Ch':'Ч','Zh':'Ж',
                      'yo': 'ё','ya':'я','yu': 'ю','ts':'ц','kh':'х','shch':'щ','sh':'ш','ch':'ч',
                      'a':'а','b':'б','v':'в','g':'г','d':'д','e':'е','zh':'ж',
                      'z':'з','i':'и','y':'й','k':'к','l':'л','m':'м','n':'н',
                      'o':'о','p':'п','r':'р','s':'с','t':'т','u':'у','f':'ф',
                      'y':'ы',"'":'ь','e':'э',
                      'A':'А','B':'Б','V':'В','G':'Г','D':'Д','E':'Е','Z':'З',
                      'I':'И','Y':'Й','K':'К','L':'Л','M':'М','N':'Н','O':'О',
                      'P':'П','R':'Р','S':'С','T':'Т','U':'У','F':'Ф','E':'Э'}
    if re.findall(r'[а-яА-Я]', text): #если в тексте присутствует кириллица, то:
        text = re.sub(r'(?<=[ иаоуыёяюеИAОУЫЁЯЮЕьъ])[еЕ]', 'yе', ' '+text) #находим все е, перед которыми гласный/ъ/ь/ничего нет и заменяем на ye
        for key in ru_eng_alphabet: #заменяем каждую букву с кириллицы на литиницу
            text = text.replace(key, ru_eng_alphabet[key])
    elif re.findall(r'[a-zA-Z]', text): #если же в тексте присутствует латиница, то:
        text = re.sub(r'(?<=[aiyuo])y(?= )', 'й', ' '+text)
        for key in eng_ru_alphabet: #заменяем каждую букву с литиницы на кириллицу
            text = text.replace(key, eng_ru_alphabet[key])
    return text

while True:
    while True:
        answer = input('Вы хотите транслитерировать текст здесь(1) или в файле(2)? Ответ дайте цифрой: ')
        if answer == '1': #работаем над словами
            text = input('Введите слово/сочетание слов: ')
            print(transliterate(text))
            break
        if answer == '2': #работаем над файлом
            file_name = input('Введите название существующего в одной папке с прокетом текстового файла в формате "название.txt": ')
            text = open(file_name, 'r').read()
            with open('Результат транслитерации.txt', 'w') as file:
                file.write(transliterate(text) + '\n\n')
            print('Готово! Вы можете найти результат транслитерации в одноименном файле в той же папке, что и данный код.')
            break
        else:
            print('Произошла ошибка. Перечитайте задание и введите исправленный ответ: ')

    answer = input('Хотите транслитерировать что-нибудь еще? Напишите да/нет или da/net: ')
    if answer == 'нет' or answer == 'net' or answer == 'Нет' or answer == 'Net' or answer == 'No' or answer == 'no':
        break
    elif answer == 'да' or answer == 'da' or answer == 'Да' or answer == 'Da' or answer == 'Yes' or answer == 'yes':
        continue
    else:
        print("Извини, я не поняла твой ответ, поэтому запускаю программу еще раз. Если ты транслитерировал_а все, что хотел_а, то можешь просто выключить программу.")
