# prepositions = предлоги
# particles = частицы
# conjunctions = союзы
# interjections = междометия 
# pronouns = местоимения
# numerals = числительные 
prepositions = ['без','безо','близ','в','во','вместо','вне','для','до','за','из','изо','из-за','из-под','к','ко','кроме','между','меж','на','над','надо','о','об','обо','от','ото','перед','пред','предо','передо','по','под','подо','при','про','ради','с','со','сквозь','среди','у','через','чрез']
particles = ['не','ни','вовсе не','далеко не','отнюдь не','неужели','разве','ли','ль','вот','вон','это','именно','как раз','прямо','подлинно','приблизительно','точь-в-точь','точно','только','исключительно','лишь','почти','единственно','просто','хотя бы','-то','что за','ну и','как','ведь','даже','же','уж','и','всё','всё же','всё-таки','ну','едва ли','вряд ли','пусть','давай','дай','а ну','-ка','будто','как будто','как бы','словно','да','так','правда','конечно']
conjunctions = ['а','а вдобавок','а именно','а также','а то','благодаря тому что','благо','буде','будто','вдобавок','в результате чего','в результате того что','в связи с тем что','в силу того что','в случае если','в то время как','в том случае если','в силу чего','ввиду того что','вопреки тому что','вроде того как','вследствие чего','вследствие того что','да вдобавок','да ещё','да','да и','да и то','дабы','даже','даром что','для того чтобы','же','едва','ежели','если','если бы','затем чтобы','затем что','зато','зачем','и','и всё же','и значит','а именно','и поэтому','и притом','и всё-таки','и следовательно','и то','и тогда','и ещё','ибо','и вдобавок','из-за того что','или','кабы','как','как скоро','как будто','как если бы','как словно','как только','когда','коли','как-то','к тому же','кроме того','либо','лишь','лишь бы','лишь только','между тем как','нежели','невзирая на то что','независимо от того что','несмотря на то что','но','однако','особенно','оттого','оттого что','отчего','перед тем как','по мере того как','по причине того что','подобно тому как','пока','покамест','покуда','пока не','после того как','поскольку','потому','потому что','почему','прежде чем','при всём том что','при условии что','притом','причём','пускай','пусть','ради того чтобы','раз','раньше чем','с тем чтобы','с тех пор как','словно','так как','так что','также','тем более что','тогда как','то есть','тоже','только','только бы','только лишь','только что','только чуть','точно','хотя','чем','что','чтоб','чтобы']
interjections = ['а','а как же','а то как же','а то нет','а толку что','а толку-то','а чего ж','а что','а что ж','а-а','а-а-а','а-а-а-а','ааа','абзац','агу','агуленьки','агулечки','агунюшки','агушечки','адью','ае','ай','ай да','ай-ай-ай','ай-люли','ай-я-яй','ай-яй-яй','айда','айда-те','айдате','аксиос','алаверды','алё','алле','алле-гоп','аллилуйя','алло','ам','ам-ам','амба','аминь','анкор','ап','апорт','ариведерчи','асеньки','асса','ась','атанда','атанде','атас','ату','ать','ау','ауфидерзейн','ах','ах вон что','ах вот как','ах вот что','ах так','ах-ах','ах ты','ах-ах-ах','ахти','ахти-хти','ахтунг','ба','ба,ба,ба','баиньки','баиньки-баю','бай-бай','банзай','баста','бац','баю','баю-бай','баю-баю','баю-баю-баю','баю-баюшки-баю','баюшки-баю','бе','безобразие','бинго','бис','бла-бла-бла','блин','бо-бо','боже','бр','брависсимо','браво','брейк','брысь','бугага','будет','буц','бяша','вау','вах','виват','вира','вольно','вон','всё','всего','вуаля','га','гав','гайда','ге','гей','геть','гип-гип','гип-гип-ура','гля','глядь','гм','гмм','го','гой','гоп','гоп-ля','гопля','горько','господи','гугу','гули','гулиньки','гуль','да-а','да-да','да-да-да','долой','досвидос','достаточно','дудочки','дык','ё','ё-моё','ей-богу','ей-Богу','ей-ей','ёклмн','ёксель-моксель','ёлки-палки','ёлки-моталки','ёлы-палы','ёпрст','ессно','естественно','есть','ёшкин кот','жесть','здорово','здравствуй','здравствуйте','здрасте','здрасьте','и','и-го-го','извините','иншала','иншалла','иншаллах','исполать','их','йоу','как бы не так','кап','карамба','кек','кис-кис','ко-ко-ко','кругом','крутяк','кусь','кхм','кш','кыс','кыш','ловко','ля-ля-ля','м','м-да','м-м','м-м-м','майна','мама мия','маран-афа','марш','матушки','мах','ме','мерси','мм','могила','мотор','мяу','н-да','нате','не-ет','ни-ни','но','но-но','ну','ну-ка','ну-кась','ну-кася','ну-ко','ну-кось','ну-ну','ну-тка','нуте','нуте-ка','нуте-с','ня','о','о-го-го','о-ля-ля','о-о','о-хо-хо','окей','оба-на','ого','огонь','однако','одначе','ой','ой-йо','ок','оп','опа','опаньки','опля','осторожно','оставить','оу','ох','охоньки','охохоньки','охохонюшки','охохохоньки','охохошеньки','охти','пак','пас','пиль','пли','плие','поди','подожди','покеда','полундра','постой','превед','прекрасно','привет','проехали','прозит','проклятие','простите','прочь','прощайте','прысь','псст','пст','пух','пфу','пфуй','пшш','р','раз-два','салам','салют','салям','светыньки','слышь','сорри','сорян','спокойно','ссс','стоп','стопэ','супер','счастливо','тик-так','то-то','топ','точнямба','тпру','трах','тррр','тс','тсс','тубо','тьфу','тю','тюк','тяф','у','увы','угу','ужо','ужотко','упс','ура','уря','уси-пуси','усь','уф','ух','фап','фас','фи','физкульт-привет','фить','фу-ты','фу-фу','фуй','фук','фырк','фьють','фюйть','ха','ха-ха','ха-ха-ха','хана','хаюшки','хвать','хе','хе-хе','хех','хи','хи-хи','хлесть','хлобысть','хлысть','хлясть','хм','хны','хо-хо','хорэ','хр-р-р','хрусть','хрясть','хрясь','ц-ц-ц','цап','цок','цып-цып','цыц','чао','чёрт его знает','чирик','чих','чу','чур','чух','чш','чш-ш','ш-ш','ш-ш-ш','ша','шабаш','шит','шлик','шу','шш','щёлк','щуп','ых','э','э-ге-ге','э-хе-хе','э-э','э-э-э','эва']
pronouns = ['я','ты','он','она','оно','они','мы','вы','Вы','себя','мой','моя','моё','мои','твой','твоя','твоё','твои','ваша','ваш','ваше','ваши','Ваш','Ваше','Ваша','Ваши','наш','наша','наше','наши','свой','своя','своё','свои','его','её','их','тот','та','то','те','этот','это','эта','эти','такой','такая','такое','такие','таков','такова','таково','таковы','столько','весь','вся','все','всё','любой','любая','любое','любые','всякий','всякая','всякое','всякие','каждый','каждая','каждое','каждые','сам','сама','само','сами','другой','другая','другое','другие','самый','самая','самое','самые','иной','иная','иное','иные','кто','что','какой','какая','какое','какие','каков','какова','каково','каковы','чей','сколько','чья','чьё','чьи','никто','некто','ничто','нечто','никакой','никакая','никакое','никакие','ничей','нисколько','несколько','кто-то','что-то','какой-то','какая-то','какое-то','какие-то','кто-нибудь','что-нибудь','какой-нибудь','какая-нибудь','какое-нибудь','какие-нибудь','кто-либо','что-либо','какой-либо','какая-либо','какое-либо','какие-либо','кое-кто','кое-что','кое-какой','кое-какая','кое-какое','кое-какие','некий','некая','некое','некие']
numerals = ['ноль','один','два','три','четыре','пять','шесть','семь','восемь','девять','десять','сорок','девяносто','сто','двести','тысяча','миллион','миллиард','триллиард']
while True:
    word = input('Введите слово, и мы попробуем определить его часть речи: ')
    l = len(word)
    print('Возможная часть(и) речи слова:')
    for x in prepositions:
        if word == x:
            print('предлог')
    for x in particles:
        if word == x:
            print('частица')
    for x in conjunctions:
        if word == x:
            print('союз')
    for x in interjections:
        if word == x:
            print('междометие')
    for x in pronouns:
        if word == x:
            print('местоимение')
    for x in numerals:
        if (word == x) or (word == x + 'дцать') or (word == x + 'десят') or (word == x + 'ста') or (word == x + 'сот'):
            print('числительное')
    if 'надцать' in word:
        print('числительное')
    if l > 1: #чтобы программа не приняла за предлог или союз
        if (word[-1] == 'о') or (word[-1] == 'е') or (word[-1] == 'а') or (word[-1] == 'я') or (word[-1] == 'у') or(word[-1] == 'ю') or (word[-1] == 'и') or ((word[-2] + word[-1]) == 'чь') or ((word[-2] + word[-1]) == 'шь'):
            print('наречие')
    if (l > 2) and (word != 'вши'): #чтобы программа не приняла за другие другие части речи
        if (word[-1] == 'я') or (word[-1] == 'а') or (word[-1] == 'в') or ((word[-2] + word[-1]) == 'ши') or ((word[-3] + word[-2] + word[-1]) == 'вши'):
            print('деепричастие')
    if l > 4: #чтобы не было ошибки, если слово короче 4 символов
        if (((word[-4] + word[-3]) == 'ущ') or ((word[-4] + word[-3]) == 'ющ') or ((word[-4] + word[-3]) == 'ащ') or ((word[-4] + word[-3]) == 'ящ')) and (((word[-2] + word[-1]) == 'ий') or((word[-2] + word[-1]) == 'ая') or((word[-2] + word[-1]) == 'ее') or((word[-2] + word[-1]) == 'ие')):
            print('причастие')
    if l > 2: #чтобы программа не приняла за междометия
        if ((word[-2] + word[-1]) == 'ой') or ((word[-2] + word[-1])== 'ый') or ((word[-2] + word[-1])== 'ий') or ((word[-2] + word[-1]) == 'ая') or ((word[-2] + word[-1]) == 'яя') or ((word[-2] + word[-1]) == 'ое') or ((word[-2] + word[-1]) == 'ее') or ((word[-2] + word[-1]) == 'ие') or ((word[-2] + word[-1]) == 'ые'):
            print('прилагательное')
    if l > 3: #чтобы программа не приняла за междометия
        if ((word[-3] + word[-2] + word[-1]) == 'ать') or ((word[-3] + word[-2] + word[-1]) == 'ять') or ((word[-3] + word[-2] + word[-1]) == 'оть') or ((word[-3] + word[-2] + word[-1]) == 'еть') or ((word[-3] + word[-2] + word[-1]) == 'уть') or ((word[-3] + word[-2] + word[-1]) == 'ють') or ((word[-3] + word[-2] + word[-1]) == 'ыть') or ((word[-3] + word[-2] + word[-1]) == 'ить'):
            print('глагол')
    if l > 1:
        print('существительное')
